//=============================================
//
//ウェーブ処理[wave.cpp]
//Auther Matsuda Towa
//
//=============================================
#include "wave_one.h"

const CWave_One::EnemyInfo CWave_One::ENEMY_INFO[NUM_ENEMY]
{
	{{50.0f,0.0f,0.0f},CEnemy::ENEMY_000},
	{{-50.0f,0.0f,0.0f},CEnemy::ENEMY_000},
};

//=============================================
//コンストラクタ
//=============================================
CWave_One::CWave_One()
{
}

//=============================================
//デストラクタ
//=============================================
CWave_One::~CWave_One()
{
}

//=============================================
//初期化
//=============================================
HRESULT CWave_One::Init()
{
	CWave::Init();

	for (int nCnt = 0; nCnt < NUM_ENEMY; ++nCnt)
	{
		CEnemy::Create(ENEMY_INFO[nCnt].pos, ENEMY_INFO[nCnt].type);
	}

	return S_OK;
}

//=============================================
//終了
//=============================================
void CWave_One::Uninit()
{
	CWave::Uninit();
}

//=============================================
//更新
//=============================================
void CWave_One::Update()
{
	CWave::Update();
}
